Revit 2027 API
LoadCase.IsNumberUnique Method
 Checks that a given number is unique among all load cases.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsNumberUnique(
	Document document,
	int number
)
Public Shared Function IsNumberUnique (
	document As Document,
	number As Integer
) As Boolean
public:
static bool IsNumberUnique(
	Document^ document,
	int number
)
static member IsNumberUnique :
        document : Document *
        number : int -> bool
Parameters
document Document
number Int32
 The number to check.
Return Value
Boolean
 True if the given number is unique among all load cases, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LoadCase Class
Autodesk.Revit.DB.Structure Namespace